//
//  data.h
//  BaejuProject
//
//  Created by myungki cho on 2020/12/17.
//

#ifndef data_h
#define data_h
#include "datatype.h"
#include <vector>

std::vector<user_database> user_list{
    {"조명기", "chobe", "1234", 10000},
    {"배주형", "chobe1", "12341", 20000},
    {"배승현", "chobe2", "12342", 30000},
    {"김승지", "chobe3", "12343", 40000},
    {"유영준", "chobe4", "12344", 50000},
    {"고세나", "chobe5", "12345", 60000},
    {"조명기6", "chobe6", "12346",70000},
    {"조명기7", "chobe7", "12347", 80000},
    {"조명기8", "chobe8", "12348", 90000},
    {"조명기9", "chobe9", "12349", 100000}
};

food main_food[10]={
    {1,"제육볶음",5500,0},
    {2,"제육볶음",5500,0},
    {3,"제육볶음",5500,0},
    {4,"제육볶음",5500,0},
    {5,"제육볶음",5500,0},
    {6,"제육볶음",5500,0},
    {7,"제육볶음",5500,0},
    {8,"제육볶음",5500,0},
    {9,"제육볶음",5500,0},
    {10,"제육볶음",5500,0},
};


food side_food[10]={
    {1,"제육볶음",5500,0},
    {2,"제육볶음",5500,0},
    {3,"제육볶음",5500,0},
    {4,"제육볶음",5500,0},
    {5,"제육볶음",5500,0},
    {6,"제육볶음",5500,0},
    {7,"제육볶음",5500,0},
    {8,"제육볶음",5500,0},
    {9,"제육볶음",5500,0},
    {10,"제육볶음",5500,0},
};

food drink_food[10]={
    {1,"제육볶음",5500,0},
    {2,"제육볶음",5500,0},
    {3,"제육볶음",5500,0},
    {4,"제육볶음",5500,0},
    {5,"제육볶음",5500,0},
    {6,"제육볶음",5500,0},
    {7,"제육볶음",5500,0},
    {8,"제육볶음",5500,0},
    {9,"제육볶음",5500,0},
    {10,"제육볶음",5500,0},
};
#endif /* data_h */
